mountaineer_billing/__tests__/fixtures/stripe_flows/subscription/6_customer.subscription.created.json

{
    "id": "evt_1RPsA8RGAudMahWRMh7ZtStU",
    "object": "event",
    "api_version": "2025-04-30.basil",
    "created": 1747516855,
    "data": {
        "object": {
            "id": "sub_1RPsA6RGAudMahWRowPFCtUQ",
            "object": "subscription",
            "application": null,
            "application_fee_percent": null,
            "automatic_tax": {
                "disabled_reason": null,
                "enabled": false,
                "liability": null
            },
            "billing_cycle_anchor": 1747516853,
            "billing_cycle_anchor_config": null,
            "cancel_at": null,
            "cancel_at_period_end": false,
            "canceled_at": null,
            "cancellation_details": {
                "comment": null,
                "feedback": null,
                "reason": null
            },
            "collection_method": "charge_automatically",
            "created": 1747516853,
            "currency": "usd",
            "customer": "cus_SKXENLZtmfAcAK",
            "days_until_due": null,
            "default_payment_method": "pm_1RPsA4RGAudMahWRxW70GZDe",
            "default_source": null,
            "default_tax_rates": [],
            "description": null,
            "discounts": [],
            "ended_at": null,
            "invoice_settings": {
                "account_tax_ids": null,
                "issuer": {
                    "type": "self"
                }
            },
            "items": {
                "object": "list",
                "data": [
                    {
                        "id": "si_SKXEYrWtPuG7HB",
                        "object": "subscription_item",
                        "created": 1747516853,
                        "current_period_end": 1750195253,
                        "current_period_start": 1747516853,
                        "discounts": [],
                        "metadata": {},
                        "plan": {
                            "id": "price_1RPpoIRGAudMahWRkfjEf4xl",
                            "object": "plan",
                            "active": true,
                            "amount": 1500,
                            "amount_decimal": "1500",
                            "billing_scheme": "per_unit",
                            "created": 1747507814,
                            "currency": "usd",
                            "interval": "month",
                            "interval_count": 1,
                            "livemode": false,
                            "metadata": {},
                            "meter": null,
                            "nickname": null,
                            "product": "prod_SKUnomVRW9PGPc",
                            "tiers_mode": null,
                            "transform_usage": null,
                            "trial_period_days": null,
                            "usage_type": "licensed"
                        },
                        "price": {
                            "id": "price_1RPpoIRGAudMahWRkfjEf4xl",
                            "object": "price",
                            "active": true,
                            "billing_scheme": "per_unit",
                            "created": 1747507814,
                            "currency": "usd",
                            "custom_unit_amount": null,
                            "livemode": false,
                            "lookup_key": null,
                            "metadata": {},
                            "nickname": null,
                            "product": "prod_SKUnomVRW9PGPc",
                            "recurring": {
                                "interval": "month",
                                "interval_count": 1,
                                "meter": null,
                                "trial_period_days": null,
                                "usage_type": "licensed"
                            },
                            "tax_behavior": "unspecified",
                            "tiers_mode": null,
                            "transform_quantity": null,
                            "type": "recurring",
                            "unit_amount": 1500,
                            "unit_amount_decimal": "1500"
                        },
                        "quantity": 1,
                        "subscription": "sub_1RPsA6RGAudMahWRowPFCtUQ",
                        "tax_rates": []
                    }
                ],
                "has_more": false,
                "total_count": 1,
                "url": "/v1/subscription_items?subscription=sub_1RPsA6RGAudMahWRowPFCtUQ"
            },
            "latest_invoice": "in_1RPsA6RGAudMahWRQIMSBaSM",
            "livemode": false,
            "metadata": {},
            "next_pending_invoice_item_invoice": null,
            "on_behalf_of": null,
            "pause_collection": null,
            "payment_settings": {
                "payment_method_options": {
                    "acss_debit": null,
                    "bancontact": null,
                    "card": {
                        "network": null,
                        "request_three_d_secure": "automatic"
                    },
                    "customer_balance": null,
                    "konbini": null,
                    "sepa_debit": null,
                    "us_bank_account": null
                },
                "payment_method_types": [
                    "card"
                ],
                "save_default_payment_method": "off"
            },
            "pending_invoice_item_interval": null,
            "pending_setup_intent": null,
            "pending_update": null,
            "plan": {
                "id": "price_1RPpoIRGAudMahWRkfjEf4xl",
                "object": "plan",
                "active": true,
                "amount": 1500,
                "amount_decimal": "1500",
                "billing_scheme": "per_unit",
                "created": 1747507814,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "meter": null,
                "nickname": null,
                "product": "prod_SKUnomVRW9PGPc",
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
            },
            "quantity": 1,
            "schedule": null,
            "start_date": 1747516853,
            "status": "active",
            "test_clock": null,
            "transfer_data": null,
            "trial_end": null,
            "trial_settings": {
                "end_behavior": {
                    "missing_payment_method": "create_invoice"
                }
            },
            "trial_start": null
        }
    },
    "livemode": false,
    "pending_webhooks": 2,
    "request": {
        "id": null,
        "idempotency_key": "794f3352-1c35-4bc6-a477-91682df4c882"
    },
    "type": "customer.subscription.created"
}